app/controllers/publications_controller.rb

  def index
    @publications = Publication.all
---
SELECT "publications".* FROM "publications"

  def new
    @publication = Publication.new
    @tag = Tag.all
---
SELECT "tags".* FROM "tags"

  def create
    @publication = Publication.new(publication_params)

    respond_to do |format|
      if @publication.save
---
INSERT INTO "publications" ("name", "content", "tag_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @publication.update(publication_params)
---
UPDATE "publications" SET "updated_at" = $1 WHERE "publications"."id" = $2  [["updated_at", "2022-10-10 16:19:36.851274"], ["id", 17]]

  def destroy
    @publication.destroy
---
DELETE FROM "publications" WHERE "publications"."id" = $1  [["id", 15]]